{"backend": "tensorflow", "config": [{"config": {"stateful": false, "unroll": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "kernel_regularizer": null, "return_state": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "return_sequences": true, "batch_input_shape": [null, 4, 351], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "go_backwards": false, "activation": "tanh", "trainable": true, "units": 64, "kernel_constraint": null, "use_bias": true, "name": "lstm_1", "dropout": 0.0, "dtype": "float32", "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "unroll": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "kernel_regularizer": null, "return_state": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "return_sequences": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "go_backwards": false, "activation": "tanh", "trainable": true, "units": 128, "kernel_constraint": null, "use_bias": true, "name": "lstm_2", "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "units": 351, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.6"}