{"keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "name": "lstm_1", "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "tanh", "use_bias": true, "unroll": false, "kernel_constraint": null, "recurrent_regularizer": null, "implementation": 0, "batch_input_shape": [null, 4, 370], "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "return_sequences": true, "unit_forget_bias": true, "units": 512, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "name": "lstm_2", "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "tanh", "use_bias": true, "unroll": false, "recurrent_regularizer": null, "implementation": 0, "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "return_sequences": false, "unit_forget_bias": true, "units": 512, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "units": 370, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "softmax", "trainable": true}}]}