{"keras_version": "2.0.6", "backend": "tensorflow", "config": [{"config": {"implementation": 0, "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "batch_input_shape": [null, 4, 370], "activation": "tanh", "units": 256, "activity_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "return_sequences": true, "bias_constraint": null, "use_bias": true, "stateful": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"implementation": 0, "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "activation": "tanh", "units": 256, "activity_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "return_sequences": true, "bias_constraint": null, "use_bias": true, "stateful": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "trainable": true, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"implementation": 0, "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "activation": "tanh", "units": 256, "activity_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "return_sequences": false, "bias_constraint": null, "use_bias": true, "stateful": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "trainable": true, "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "trainable": true, "activation": "linear", "units": 370, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}