{"keras_version": "2.0.6", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 30, 370], "kernel_regularizer": null, "bias_regularizer": null, "name": "lstm_1", "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "implementation": 0, "activity_regularizer": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_dropout": 0.0, "units": 512, "dtype": "float32", "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "bias_constraint": null, "unroll": false, "trainable": true, "unit_forget_bias": true, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "lstm_2", "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "implementation": 0, "activity_regularizer": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "recurrent_dropout": 0.0, "units": 512, "go_backwards": false, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "unroll": false, "trainable": true, "unit_forget_bias": true, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "units": 370, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}