{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "activity_regularizer": null, "implementation": 0, "unroll": false, "dtype": "float32", "recurrent_dropout": 0.0, "name": "lstm_1", "use_bias": true, "go_backwards": false, "activation": "tanh", "dropout": 0.0, "stateful": false, "kernel_regularizer": null, "batch_input_shape": [null, 4, 370], "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "units": 512, "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "activity_regularizer": null, "implementation": 0, "unroll": false, "recurrent_dropout": 0.0, "name": "lstm_2", "use_bias": true, "go_backwards": false, "activation": "tanh", "dropout": 0.0, "stateful": false, "kernel_regularizer": null, "return_sequences": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "units": 512, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 370, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}