{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "units": 64, "kernel_constraint": null, "return_state": false, "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "go_backwards": false, "activity_regularizer": null, "unroll": false, "bias_constraint": null, "dropout": 0.0, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "batch_input_shape": [null, 4, 370], "recurrent_regularizer": null, "kernel_regularizer": null, "stateful": false, "implementation": 0, "name": "lstm_1"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "units": 128, "kernel_constraint": null, "return_state": false, "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "go_backwards": false, "activity_regularizer": null, "unroll": false, "bias_constraint": null, "dropout": 0.0, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "implementation": 0, "name": "lstm_2"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "units": 370, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "keras_version": "2.0.6", "backend": "tensorflow"}