{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "trainable": true, "bias_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "return_sequences": true, "recurrent_activation": "hard_sigmoid", "units": 64, "batch_input_shape": [null, 4, 351], "recurrent_regularizer": null, "dropout": 0.0, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "name": "lstm_1", "kernel_constraint": null, "stateful": false, "unroll": false, "return_state": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "implementation": 0, "kernel_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "return_sequences": false, "unit_forget_bias": true, "units": 128, "recurrent_regularizer": null, "dropout": 0.0, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "name": "lstm_2", "kernel_constraint": null, "stateful": false, "unroll": false, "return_state": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "implementation": 0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 351, "activation": "linear", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}