{"keras_version": "2.0.6", "config": [{"config": {"name": "lstm_1", "kernel_constraint": null, "return_state": false, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "trainable": true, "return_sequences": true, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "batch_input_shape": [null, 30, 370], "recurrent_activation": "hard_sigmoid", "units": 512, "stateful": false, "go_backwards": false, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "implementation": 0, "recurrent_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "use_bias": true}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "lstm_2", "kernel_constraint": null, "return_state": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "unroll": false, "bias_constraint": null, "trainable": true, "return_sequences": false, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 512, "stateful": false, "go_backwards": false, "dropout": 0.0, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "implementation": 0, "recurrent_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "use_bias": true}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "kernel_constraint": null, "units": 370, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}