{"config": [{"config": {"recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_regularizer": null, "kernel_constraint": null, "return_state": false, "kernel_regularizer": null, "recurrent_constraint": null, "batch_input_shape": [null, 4, 351], "unroll": false, "go_backwards": false, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "trainable": true, "implementation": 0, "use_bias": true, "unit_forget_bias": true, "units": 64, "dropout": 0.0, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "dropout": 0.0, "return_sequences": false, "return_state": false, "kernel_constraint": null, "recurrent_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "trainable": true, "implementation": 0, "use_bias": true, "unit_forget_bias": true, "units": 128, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_2", "activation": "tanh", "bias_regularizer": null, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 351, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential"}