{"backend": "tensorflow", "keras_version": "2.0.6", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "go_backwards": false, "name": "lstm_1", "dropout": 0.0, "kernel_regularizer": null, "batch_input_shape": [null, 4, 370], "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": true, "kernel_constraint": null, "dtype": "float32", "unroll": false, "activation": "tanh", "stateful": false, "trainable": true, "implementation": 0}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "go_backwards": false, "name": "lstm_2", "dropout": 0.0, "kernel_regularizer": null, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": false, "kernel_constraint": null, "unroll": false, "activation": "tanh", "unit_forget_bias": true, "trainable": true, "implementation": 0}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "units": 370, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}