{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "units": 64, "recurrent_constraint": null, "recurrent_regularizer": null, "trainable": true, "return_state": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "name": "lstm_1", "go_backwards": false, "bias_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unroll": false, "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 4, 351], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "use_bias": true, "implementation": 0, "stateful": false}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "units": 128, "recurrent_constraint": null, "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "return_state": false, "go_backwards": false, "bias_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unroll": false, "implementation": 0, "name": "lstm_2", "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "unit_forget_bias": true, "use_bias": true, "stateful": false}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 351, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "backend": "tensorflow"}