{"config": [{"config": {"unroll": false, "trainable": true, "implementation": 0, "use_bias": true, "dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_constraint": null, "units": 512, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "unit_forget_bias": true, "name": "lstm_1", "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 4, 1], "return_state": false, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"unroll": false, "trainable": true, "implementation": 0, "dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_constraint": null, "units": 512, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "unit_forget_bias": true, "name": "lstm_2", "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "return_sequences": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "units": 16, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential"}