{"keras_version": "2.0.6", "backend": "tensorflow", "config": [{"config": {"recurrent_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 1, 351], "unroll": false, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 0, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "bias_constraint": null, "return_sequences": true, "unit_forget_bias": true, "dtype": "float32", "units": 256, "activity_regularizer": null, "go_backwards": false, "bias_regularizer": null, "trainable": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "use_bias": true, "kernel_constraint": null, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "unroll": false, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 0, "name": "lstm_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "bias_constraint": null, "return_sequences": false, "unit_forget_bias": true, "units": 512, "activity_regularizer": null, "go_backwards": false, "bias_regularizer": null, "trainable": true, "recurrent_regularizer": null, "stateful": false, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"units": 351, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}