{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "kernel_regularizer": null, "units": 512, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "unroll": false, "return_sequences": true, "kernel_constraint": null, "go_backwards": false, "name": "lstm_1", "implementation": 0, "activation": "tanh", "recurrent_dropout": 0.0, "return_state": false, "use_bias": true, "trainable": true, "dtype": "float32", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 4, 1]}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "units": 512, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "unroll": false, "return_sequences": false, "kernel_constraint": null, "go_backwards": false, "name": "lstm_2", "implementation": 0, "activation": "tanh", "recurrent_dropout": 0.0, "return_state": false, "use_bias": true, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "units": 41, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.6", "class_name": "Sequential"}