{"keras_version": "2.0.6", "backend": "tensorflow", "config": [{"config": {"go_backwards": false, "return_state": false, "name": "lstm_1", "implementation": 0, "activation": "tanh", "trainable": true, "activity_regularizer": null, "unroll": false, "bias_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "bias_regularizer": null, "use_bias": true, "units": 256, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "stateful": false, "return_sequences": false, "batch_input_shape": [null, 4, 351], "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 351, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}