{"config": [{"config": {"implementation": 0, "return_sequences": false, "dtype": "float32", "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "return_state": false, "use_bias": true, "batch_input_shape": [null, 4, 351], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "lstm_1", "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "unroll": false, "recurrent_dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 351, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}