{"config": [{"config": {"name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "implementation": 0, "stateful": false, "go_backwards": false, "units": 512, "trainable": true, "return_sequences": true, "use_bias": true, "batch_input_shape": [null, 4, 370], "bias_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "dropout": 0.0, "return_state": false, "activation": "tanh", "bias_regularizer": null, "recurrent_regularizer": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "lstm_2", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "implementation": 0, "stateful": false, "go_backwards": false, "units": 512, "trainable": true, "recurrent_constraint": null, "use_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dropout": 0.0, "return_state": false, "activation": "tanh", "bias_regularizer": null, "recurrent_regularizer": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "units": 512, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "units": 370, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}