{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "lstm_1", "trainable": true, "stateful": false, "dropout": 0.0, "return_state": false, "recurrent_dropout": 0.0, "return_sequences": true, "bias_constraint": null, "implementation": 0, "unroll": false, "units": 512, "batch_input_shape": [null, 4, 370], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "tanh", "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "lstm_2", "trainable": true, "stateful": false, "dropout": 0.0, "return_state": false, "recurrent_dropout": 0.0, "return_sequences": false, "bias_constraint": null, "implementation": 0, "unroll": false, "units": 512, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "tanh", "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 370, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "keras_version": "2.0.6"}