{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "LSTM", "config": {"units": 512, "recurrent_constraint": null, "unroll": false, "dropout": 0.0, "go_backwards": false, "unit_forget_bias": true, "batch_input_shape": [null, 4, 370], "kernel_regularizer": null, "return_state": false, "use_bias": true, "trainable": true, "return_sequences": true, "activation": "tanh", "implementation": 0, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "dtype": "float32", "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 512, "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "dropout": 0.0, "go_backwards": false, "unit_forget_bias": true, "units": 512, "kernel_regularizer": null, "trainable": true, "use_bias": true, "return_state": false, "return_sequences": false, "activation": "tanh", "implementation": 0, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 370, "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_2", "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "softmax", "trainable": true}}]}